; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v10 ?v11)
             (pred_4 ?v9 ?v2)
             (pred_10 ?v10 ?v2)
             (pred_6 ?v5 ?v10 )
	     (pred_2 ?v10)
             (pred_12 ?v7)
             (pred_5 ?v9)
             (pred_11 ?v2)
             (pred_9 ?v10)
             (pred_8 ?v9)
             (pred_3 ?v10)
             (pred_7 ))



(:action op_4
:parameters (?v3 ?v6 ?v1 ?v8)
:precondition (and (pred_12 ?v3) (pred_12 ?v6) (pred_5 ?v1) (pred_11 ?v8)
          (pred_1 ?v3 ?v6) (pred_4 ?v1 ?v8)
                   (pred_10 ?v6 ?v8) (pred_2 ?v3) 
                   (pred_9 ?v6) (pred_8 ?v1))
:effect (and  (pred_3 ?v6) (not (pred_9 ?v6))))


(:action op_3
:parameters (?v3 ?v13)
:precondition (and (pred_12 ?v3) (pred_12 ?v13)
               (pred_2 ?v3) (pred_1 ?v3 ?v13) (pred_3 ?v13))
:effect (and (pred_2 ?v13) (not (pred_2 ?v3))))

(:action op_2
:parameters (?v3 ?v1)
:precondition (and (pred_12 ?v3) (pred_5 ?v1) 
                  (pred_2 ?v3) (pred_6 ?v1 ?v3) (pred_7 ))
:effect (and (pred_8 ?v1)
   (not (pred_6 ?v1 ?v3)) (not (pred_7 ))))


(:action op_1
:parameters (?v3 ?v4 ?v12)
:precondition (and (pred_12 ?v3) (pred_5 ?v4) (pred_5 ?v12)
                  (pred_2 ?v3) (pred_8 ?v12) (pred_6 ?v4 ?v3))
:effect (and (pred_8 ?v4) (pred_6 ?v12 ?v3)
        (not (pred_8 ?v12)) (not (pred_6 ?v4 ?v3))))

(:action op_5
:parameters (?v3 ?v1)
:precondition (and (pred_12 ?v3) (pred_5 ?v1) 
                  (pred_2 ?v3) (pred_8 ?v1))
:effect (and (pred_7 ) (pred_6 ?v1 ?v3) (not (pred_8 ?v1)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_08 obj_27 obj_16 obj_19 obj_22 obj_25 obj_15 obj_26 obj_21 obj_05 obj_06 obj_11 obj_02 obj_10 obj_17 obj_18 obj_29 obj_07 obj_09 obj_28 obj_01 obj_24 obj_03 obj_31 obj_12
    obj_23 obj_32 obj_20
    obj_13 obj_14 obj_30 obj_04
    )

    (:init
       (pred_7)

       (pred_12 obj_08)
       (pred_12 obj_27)
       (pred_12 obj_16)
       (pred_12 obj_19)
       (pred_12 obj_22)
       (pred_12 obj_25)
       (pred_12 obj_15)
       (pred_12 obj_26)
       (pred_12 obj_21)
       (pred_12 obj_05)
       (pred_12 obj_06)
       (pred_12 obj_11)
       (pred_12 obj_02)
       (pred_12 obj_10)
       (pred_12 obj_17)
       (pred_12 obj_18)
       (pred_12 obj_29)
       (pred_12 obj_07)
       (pred_12 obj_09)
       (pred_12 obj_28)
       (pred_12 obj_01)
       (pred_12 obj_24)
       (pred_12 obj_03)
       (pred_12 obj_31)
       (pred_12 obj_12)
       (pred_11 obj_23)
       (pred_11 obj_32)
       (pred_11 obj_20)
       (pred_5 obj_13)
       (pred_5 obj_14)
       (pred_5 obj_30)
       (pred_5 obj_04)

       (pred_1 obj_08 obj_25)
       (pred_1 obj_08 obj_27)
       (pred_1 obj_27 obj_15)
       (pred_1 obj_27 obj_16)
       (pred_1 obj_27 obj_08)
       (pred_1 obj_16 obj_26)
       (pred_1 obj_16 obj_19)
       (pred_1 obj_16 obj_27)
       (pred_1 obj_19 obj_21)
       (pred_1 obj_19 obj_22)
       (pred_1 obj_19 obj_16)
       (pred_1 obj_22 obj_05)
       (pred_1 obj_22 obj_19)
       (pred_1 obj_25 obj_06)
       (pred_1 obj_25 obj_15)
       (pred_1 obj_25 obj_08)
       (pred_1 obj_15 obj_11)
       (pred_1 obj_15 obj_26)
       (pred_1 obj_15 obj_27)
       (pred_1 obj_15 obj_25)
       (pred_1 obj_26 obj_02)
       (pred_1 obj_26 obj_21)
       (pred_1 obj_26 obj_16)
       (pred_1 obj_26 obj_15)
       (pred_1 obj_21 obj_10)
       (pred_1 obj_21 obj_05)
       (pred_1 obj_21 obj_19)
       (pred_1 obj_21 obj_26)
       (pred_1 obj_05 obj_17)
       (pred_1 obj_05 obj_22)
       (pred_1 obj_05 obj_21)
       (pred_1 obj_06 obj_18)
       (pred_1 obj_06 obj_11)
       (pred_1 obj_06 obj_25)
       (pred_1 obj_11 obj_29)
       (pred_1 obj_11 obj_02)
       (pred_1 obj_11 obj_15)
       (pred_1 obj_11 obj_06)
       (pred_1 obj_02 obj_07)
       (pred_1 obj_02 obj_10)
       (pred_1 obj_02 obj_26)
       (pred_1 obj_02 obj_11)
       (pred_1 obj_10 obj_09)
       (pred_1 obj_10 obj_17)
       (pred_1 obj_10 obj_21)
       (pred_1 obj_10 obj_02)
       (pred_1 obj_17 obj_28)
       (pred_1 obj_17 obj_05)
       (pred_1 obj_17 obj_10)
       (pred_1 obj_18 obj_01)
       (pred_1 obj_18 obj_29)
       (pred_1 obj_18 obj_06)
       (pred_1 obj_29 obj_24)
       (pred_1 obj_29 obj_07)
       (pred_1 obj_29 obj_11)
       (pred_1 obj_29 obj_18)
       (pred_1 obj_07 obj_03)
       (pred_1 obj_07 obj_09)
       (pred_1 obj_07 obj_02)
       (pred_1 obj_07 obj_29)
       (pred_1 obj_09 obj_31)
       (pred_1 obj_09 obj_28)
       (pred_1 obj_09 obj_10)
       (pred_1 obj_09 obj_07)
       (pred_1 obj_28 obj_12)
       (pred_1 obj_28 obj_17)
       (pred_1 obj_28 obj_09)
       (pred_1 obj_01 obj_24)
       (pred_1 obj_01 obj_18)
       (pred_1 obj_24 obj_03)
       (pred_1 obj_24 obj_29)
       (pred_1 obj_24 obj_01)
       (pred_1 obj_03 obj_31)
       (pred_1 obj_03 obj_07)
       (pred_1 obj_03 obj_24)
       (pred_1 obj_31 obj_12)
       (pred_1 obj_31 obj_09)
       (pred_1 obj_31 obj_03)
       (pred_1 obj_12 obj_28)
       (pred_1 obj_12 obj_31)
       (pred_9 obj_01)
       (pred_9 obj_25)
       (pred_9 obj_11)
       (pred_9 obj_31)
       (pred_10  obj_01 obj_23)
       (pred_10  obj_25 obj_32)
       (pred_10  obj_11 obj_20)
       (pred_10  obj_31 obj_23)
       (pred_3 obj_08)
       (pred_3 obj_27)
       (pred_3 obj_16)
       (pred_3 obj_19)
       (pred_3 obj_22)
       (pred_3 obj_15)
       (pred_3 obj_26)
       (pred_3 obj_21)
       (pred_3 obj_05)
       (pred_3 obj_06)
       (pred_3 obj_02)
       (pred_3 obj_10)
       (pred_3 obj_17)
       (pred_3 obj_18)
       (pred_3 obj_29)
       (pred_3 obj_07)
       (pred_3 obj_09)
       (pred_3 obj_28)
       (pred_3 obj_24)
       (pred_3 obj_03)
       (pred_3 obj_12)

       (pred_4  obj_13 obj_23)
       (pred_4  obj_14 obj_32)
       (pred_4  obj_30 obj_20)
       (pred_4  obj_04 obj_23)
       (pred_6 obj_13 obj_10)
       (pred_6 obj_14 obj_29)
       (pred_6 obj_30 obj_25)
       (pred_6 obj_04 obj_28)
       (pred_2 obj_29)
    )

    (:goal (and
       (pred_6 obj_04 obj_29)
    ))
(:constraints
  (always (not (pred_2 obj_09)))
)
)

; plan
1. (op_3 obj_29 obj_07)
   deleted: (pred_2 obj_29)
   added: (pred_2 obj_07)
   goals met: 0 of 1
2. (op_3 obj_07 obj_02)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_02)
   goals met: 0 of 1
3. (op_3 obj_02 obj_10)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_10)
   goals met: 0 of 1
4. (op_3 obj_10 obj_17)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_17)
   goals met: 0 of 1
5. (op_3 obj_17 obj_28)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_28)
   goals met: 0 of 1
6. (op_2 obj_28 obj_04)
   deleted: (pred_6 obj_04 obj_28) (pred_7)
   added: (pred_8 obj_04)
   goals met: 0 of 1
7. (op_3 obj_28 obj_17)
   deleted: (pred_2 obj_28)
   added: (pred_2 obj_17)
   goals met: 0 of 1
8. (op_3 obj_17 obj_10)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_10)
   goals met: 0 of 1
9. (op_3 obj_10 obj_02)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_02)
   goals met: 0 of 1
10. (op_3 obj_02 obj_07)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_07)
   goals met: 0 of 1
11. (op_3 obj_07 obj_29)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_29)
   goals met: 0 of 1
12. (op_1 obj_29 obj_14 obj_04)
   deleted: (pred_8 obj_04) (pred_6 obj_14 obj_29)
   added: (pred_8 obj_14) (pred_6 obj_04 obj_29)
   goals met: 1 of 1
